---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangleCut
source: html/bb633d61-429c-b20e-25b1-5ca59d1b2132.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangleCut

Defines parameters for parameterized concrete rectangle cut structural section.

## Syntax (C#)
```csharp
public class StructuralSectionConcreteRectangleCut : StructuralSectionRectangular
```